In [1]:
import pandas as pd
import numpy as np

## 데이터프레임 생성

In [2]:
df = pd.DataFrame(np.arange(12).reshape(3, 4),
                  columns=['A', 'B', 'C', 'D'])

In [3]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

## 인덱스로 행 삭제

In [4]:
df.drop(df.index[0])

   A  B   C   D
1  4  5   6   7
2  8  9  10  11

## 열의 로직으로 삭제 

-  데이터프레임의 로직을 확인한 후에 인덱스 정보를 제공해서 처리

In [5]:
df['A'] > 4

0    False
1    False
2     True
Name: A, dtype: bool

### 참값의 인덱스만 추출

In [6]:
df[df['A'] > 4].index

Int64Index([2], dtype='int64')

### 특정 행 삭제

In [7]:
df.drop(df[df['A'] > 4].index)

   A  B  C  D
0  0  1  2  3
1  4  5  6  7

## 행 삭제 : 특정 행만 선택

### 인덱스 검색에 논리값 배열 처리

In [8]:
df2 = df[df.A <= 4]

In [9]:
df2

   A  B  C  D
0  0  1  2  3
1  4  5  6  7

### loc 인덱서에서 논리값 배열 처리

In [10]:
df3 = df.loc[df["A"] <= 4 ]

In [11]:
df3

   A  B  C  D
0  0  1  2  3
1  4  5  6  7